# FeetPerKip Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..FeetPerKip Property
UnitTypeId Class See Also
---
Feet per kip.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FeetPerKip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FeetPerKip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FeetPerKip {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace